Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalGapWarning Property
 Detected physical connection between Structural Elements, but did not detect Analytical intersection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalGapWarning { get; }
Public Shared ReadOnly Property AnalyticalGapWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalGapWarning {
	FailureDefinitionId^ get ();
}
static member AnalyticalGapWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace